Repository: OYlili/Syncro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ru

# settingsTitle
source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
ru: Настройки

# settingsPlayback
source: Playback
de: Wiedergabe
es: Reproducción
fr: Lecture
ru: Воспроизведение

# settingsAppearance
source: Appearance
de: Erscheinungsbild
es: Apariencia
fr: Apparence
ru: Внешний вид

# settingsNetwork
source: Network
de: Netzwerk
es: Red
fr: Réseau
ru: Сеть

# settingsAutoPlay
source: Auto Play
de: Automatisch abspielen
es: Reproducción automática
fr: Lecture auto
ru: Автовоспроизведение

# settingsAutoPlayDesc
source: Automatically play next video
de: Nächstes Video automatisch abspielen
es: Reproducir el siguiente vídeo automáticamente
fr: Passer à la vidéo suivante
ru: Автоматически воспроизводить следующее видео

# settingsHwDecode
source: Hardware Decoding
de: Hardware-Dekodierung
es: Decodificación por hardware
fr: Décodage matériel
ru: Аппаратное декодирование

# settingsHwDecodeDesc
source: Use GPU to accelerate video decoding
de: GPU zur Videodekodierung verwenden
es: Usar GPU para acelerar la decodificación
fr: Utiliser le GPU pour accélérer le décodage
ru: Использовать GPU для ускорения декодирования

# settingsDefaultVolume
source: Default Volume
de: Standardlautstärke
es: Volumen predeterminado
fr: Volume par défaut
ru: Громкость по умолчанию

# settingsDefaultVolumeDesc
source: Default volume on startup
de: Lautstärke beim Start
es: Volumen al iniciar
fr: Volume au démarrage
ru: Громкость при запуске

# settingsDynamicColor
source: Dynamic Color
de: Dynamische Farbe
es: Color dinámico
fr: Couleur dynamique
ru: Динамический цвет

# settingsDynamicColorDesc
source: Use wallpaper color as theme
de: Hintergrundbild-Farbe als Thema
es: Usar color del fondo de pantalla
fr: Utiliser la couleur du fond d'écran
ru: Цвет обоев как тема

# settingsLanguage
source: Language
de: Sprache
es: Idioma
fr: Langue
ru: Язык

# settingsLanguageSystem
source: Follow System
de: System
es: Sistema
fr: Système
ru: Системный

# settingsAbout
source: About
de: Über
es: Acerca de
fr: À propos
ru: О приложении

# settingsAboutTitle
source: About Syncro
de: Über Syncro
es: Acerca de Syncro
fr: À propos de Syncro
ru: О Syncro

# settingsAboutDesc
source: Version info and open source link
de: Version und Open-Source-Link
es: Versión y enlace de código
fr: Version et code source
ru: Версия и ссылка на код

# settingsAboutVersion
source: Version
es: Versión
ru: Версия

# settingsAboutOpenSource
source: Open Source
es: Código abierto
fr: Code source
ru: Исходный код

# settingsTheme
source: Dark Mode
de: Design
es: Tema
fr: Thème
ru: Тема

# settingsThemeSystem
source: Follow System Settings
de: System
es: Sistema
fr: Système
ru: Системная

# settingsAutoDiscover
source: Auto Discover Rooms
de: Räume automatisch finden
es: Descubrir salas automáticamente
fr: Découverte auto
ru: Автопоиск комнат

# settingsAutoDiscoverDesc
source: Auto search available rooms on LAN
de: Verfügbare Räume im LAN suchen
es: Buscar salas disponibles en la red
fr: Rechercher les salles disponibles
ru: Автоматически искать комнаты в сети

# navRoom
source: Rooms
de: Räume
es: Salas
fr: Salles
ru: Комнаты

# navProfile
source: Profile
de: Profil
es: Perfil
fr: Profil
ru: Профиль

# playerStyle
source: Style
de: Stil
es: Estilo
ru: Стиль

# chatRoom
source: Chat
ru: Чат

# roomCreated
source: Room created. Waiting for others to join...
de: Raum erstellt. Warten auf Teilnehmer...
es: Sala creada. Esperando...
fr: Salle créée. En attente...
ru: Комната создана. Ожидание...

# playlistUpdated
source: Playlist updated ({count} videos)
de: Wiedergabeliste aktualisiert ({count} Videos)
es: Lista actualizada ({count} vídeos)
fr: Liste mise à jour ({count} vidéos)
ru: Список обновлён ({count} видео)

# chatHint
source: Type a message...
de: Nachricht eingeben...
es: Escribe un mensaje...
fr: Tapez un message...
ru: Введите сообщение...

# homeCreateRoom
source: Create Room
de: Raum erstellen
es: Crear sala
fr: Créer une salle
ru: Создать комнату

# homeJoinRoom
source: Join Room
de: Raum beitreten
es: Unirse
fr: Rejoindre
ru: Войти в комнату

# homeRoomCode
source: Room Code
de: Raumcode
es: Código de sala
fr: Code de salle
ru: Код комнаты

# homeRoomCodeHint
source: Enter room code
de: Code eingeben
es: Introduce el código
fr: Entrez le code
ru: Введите код

# homeNickname
source: Nickname
de: Spitzname
es: Apodo
fr: Pseudo
ru: Никнейм

# homeNicknameHint
source: Enter your nickname
de: Spitznamen eingeben
es: Introduce tu apodo
fr: Entrez votre pseudo
ru: Введите никнейм

# homeSelectVideo
source: Select Video
de: Video auswählen
es: Seleccionar vídeo
fr: Sélectionner une vidéo
ru: Выбрать видео

# homeNoVideo
source: No Video Selected
de: Kein Video
es: Sin vídeo
fr: Aucune vidéo
ru: Нет видео

# homeStart
source: Start
de: Starten
es: Iniciar
fr: Démarrer
ru: Начать

# homeCancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ru: Отмена

# homeConfirm
source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ru: Подтвердить

# playerPlay
source: Play
de: Abspielen
es: Reproducir
fr: Lecture
ru: Играть

# playerPause
source: Pause
es: Pausa
ru: Пауза

# playerSubtitle
source: Subtitles
de: Untertitel
es: Subtítulos
fr: Sous-titres
ru: Субтитры

# playerAudioTrack
source: Audio Track
de: Audiospur
es: Pista de audio
fr: Piste audio
ru: Аудиодорожка

# playerNoSubtitle
source: No Subtitles
de: Kein Untertitel
es: Sin subtítulos
fr: Sans sous-titres
ru: Без субтитров

# playerExternalSubtitle
source: External Subtitle
de: Externer Untertitel
es: Subtítulo externo
fr: Sous-titre externe
ru: Внешние субтитры

# playerDanmaku
source: Danmaku
de: Kommentare
es: Comentarios
fr: Commentaires
ru: Комментарии

# playerDanmakuHint
source: Send a comment...
de: Kommentar senden...
es: Enviar comentario...
fr: Envoyer un commentaire...
ru: Отправить комментарий...

# playerDanmakuSend
source: Send
de: Senden
es: Enviar
fr: Envoyer
ru: Отправить

# playlistTitle
source: Playlist
de: Wiedergabeliste
es: Lista de reproducción
fr: Liste de lecture
ru: Список воспроизведения

# playlistAdd
source: Add Video
de: Video hinzufügen
es: Añadir vídeo
fr: Ajouter
ru: Добавить видео

# playlistClear
source: Clear Playlist
de: Liste leeren
es: Limpiar lista
fr: Vider la liste
ru: Очистить список

# playlistClearConfirm
source: Clear all videos? This cannot be undone.
de: Alle Videos löschen? Nicht rückgängig zu machen.
es: ¿Borrar todos los vídeos? No se puede deshacer.
fr: Vider toutes les vidéos ? Impossible d'annuler.
ru: Удалить все видео? Это нельзя отменить.

# playlistEmpty
source: Playlist is empty
de: Liste ist leer
es: Lista vacía
fr: Liste vide
ru: Список пуст

# roomMemberCount
source: {count} online
es: {count} en línea
fr: {count} en ligne
ru: {count} онлайн

# roomHost
source: Host
de: Gastgeber
es: Anfitrión
fr: Hôte
ru: Хост

# roomMember
source: Member
de: Mitglied
es: Miembro
fr: Membre
ru: Участник

# roomLeave
source: Leave Room
de: Raum verlassen
es: Salir de la sala
fr: Quitter
ru: Покинуть комнату

# roomLeaveConfirm
source: Are you sure you want to leave?
de: Möchten Sie wirklich verlassen?
es: ¿Seguro que quieres salir?
fr: Voulez-vous vraiment quitter ?
ru: Вы уверены, что хотите выйти?

# roomDisbandConfirm
source: You are the host. Leaving will disband the room. Continue?
de: Sie sind der Gastgeber. Verlassen löst den Raum auf. Fortfahren?
es: Eres el anfitrión. Salir disolverá la sala. ¿Continuar?
fr: Vous êtes l'hôte. Partir dissoudra la salle. Continuer ?
ru: Вы хост. Выход распустит комнату. Продолжить?

# errorNetworkFailed
source: Network connection failed
de: Netzwerkfehler
es: Error de red
fr: Échec de la connexion réseau
ru: Ошибка сети

# errorFileNotFound
source: File not found
de: Datei nicht gefunden
es: Archivo no encontrado
fr: Fichier introuvable
ru: Файл не найден

# errorSubtitleExtractFailed
source: Subtitle extraction failed
de: Untertitel-Extraktion fehlgeschlagen
es: Error al extraer subtítulos
fr: Échec de l'extraction des sous-titres
ru: Ошибка извлечения субтитров

# errorRoomNotFound
source: Room not found
de: Raum nicht gefunden
es: Sala no encontrada
fr: Salle introuvable
ru: Комната не найдена

# errorNicknameEmpty
source: Nickname cannot be empty
de: Spitzname darf nicht leer sein
es: El apodo no puede estar vacío
fr: Le pseudo ne peut pas être vide
ru: Никнейм не может быть пустым

# successJoinRoom
source: Successfully joined the room
de: Erfolgreich beigetreten
es: Sala unida con éxito
fr: Salle rejointe avec succès
ru: Вы успешно вошли в комнату

# successSubtitleLoaded
source: Subtitle loaded successfully
de: Untertitel geladen
es: Subtítulo cargado
fr: Sous-titre chargé
ru: Субтитры загружены

# loadingHostVideo
source: Loading host's shared video...
de: Lade geteiltes Video des Hosts...
es: Cargando vídeo compartido del anfitrión...
fr: Chargement de la vidéo partagée par l'hôte...
ru: Загрузка видео, разделяемого хостом...

source: Brightness
de: Helligkeit
es: Brillo
fr: Luminosité
ru: Яркость

source: Volume
de: Lautstärke
es: Volumen
ru: Громкость

source: Send danmaku...
de: Kommentar senden...
es: Enviar comentario...
fr: Envoyer un commentaire...
ru: Отправить комментарий...

source: Hide Chat
de: Chat ausblenden
es: Ocultar chat
fr: Cacher le chat
ru: Скрыть чат

source: Show Chat
de: Chat anzeigen
es: Mostrar chat
fr: Afficher le chat
ru: Показать чат

source: Open Video
de: Video öffnen
es: Abrir vídeo
fr: Ouvrir la vidéo
ru: Открыть видео

source: Fullscreen
de: Vollbild
es: Pantalla completa
fr: Plein écran
ru: Полноэкранный режим

source: Playback Error
de: Wiedergabefehler
es: Error de reproducción
fr: Erreur de lecture
ru: Ошибка воспроизведения

source: Unknown Error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
ru: Неизвестная ошибка

source: Select Other Video
de: Anderes Video auswählen
es: Seleccionar otro vídeo
fr: Sélectionner une autre vidéo
ru: Выбрать другое видео

source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
ru: Повторить

source: No Video
de: Kein Video
es: Sin vídeo
fr: Aucune vidéo
ru: Нет видео

# tapFolderIconSelectVideo
source: Tap the folder icon above to select video files
de: Tippen Sie auf das Ordnersymbol oben, um Videodateien auszuwählen
es: Toca el icono de carpeta arriba para seleccionar archivos de vídeo
fr: Tapez l'icône dossier ci-dessus pour sélectionner des vidéos
ru: Нажмите на иконку папки выше, чтобы выбрать видеофайлы

source: Select Video
de: Video auswählen
es: Seleccionar vídeo
fr: Sélectionner une vidéo
ru: Выбрать видео

# createPlaylistFailed
source: Failed to create playlist
de: Erstellung der Wiedergabeliste fehlgeschlagen
es: Error al crear la lista de reproducción
fr: Échec de création de la liste
ru: Не удалось создать список воспроизведения

# addVideoFailed
source: Failed to add video
de: Hinzufügen des Videos fehlgeschlagen
es: Error al añadir el vídeo
fr: Échec d'ajout de la vidéo
ru: Не удалось добавить видео

# selectVideoFailed
source: Failed to select video
de: Auswählen des Videos fehlgeschlagen
es: Error al seleccionar el vídeo
fr: Échec de sélection de la vidéo
ru: Не удалось выбрать видео

source: Share Room IP
de: Raum-IP teilen
es: Compartir IP de la sala
fr: Partager l'IP de la salle
ru: Поделиться IP комнаты

source: Dissolve Room
de: Raum auflösen
es: Disolver sala
fr: Dissoudre la salle
ru: Распустить комнату

source: Leave Room
de: Raum verlassen
es: Salir de la sala
fr: Quitter la salle
ru: Покинуть комнату

source: Share Room
de: Raum teilen
es: Compartir sala
fr: Partager la salle
ru: Поделиться комнатой

# otherUsersCanJoinRoom
source: Other users can join the room using the following information:
de: Andere Benutzer können den Raum mit folgenden Informationen beitreten:
es: Otros usuarios pueden unirse a la sala con la siguiente información:
fr: Les autres utilisateurs peuvent rejoindre via :
ru: Другие пользователи могут присоединиться к комнате, используя следующую информацию:

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ru: Закрыть

source: Exit Room
de: Raum verlassen
es: Salir de la sala
fr: Quitter la salle
ru: Выйти из комнаты

# confirmExitCurrentRoom
source: Are you sure you want to exit the current room?
de: Möchten Sie den aktuellen Raum wirklich verlassen?
es: ¿Seguro que quieres salir de la sala actual?
fr: Voulez-vous vraiment quitter la salle ?
ru: Вы уверены, что хотите выйти из текущей комнаты?

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ru: Отмена

source: Exit
de: Verlassen
es: Salir
fr: Quitter
ru: Выйти

# confirmLeaveCurrentRoom
source: Are you sure you want to leave the current room?
de: Möchten Sie den aktuellen Raum wirklich verlassen?
es: ¿Seguro que quieres salir de la sala actual?
fr: Voulez-vous vraiment quitter la salle ?
ru: Вы уверены, что хотите выйти из текущей комнаты?

source: Leave
de: Verlassen
es: Salir
fr: Quitter
ru: Покинуть

source: End Room
de: Raum beenden
es: Terminar sala
fr: Terminer la salle
ru: Завершить комнату

# confirmEndRoom
source: Are you sure you want to end the room?
de: Möchten Sie den Raum wirklich beenden?
es: ¿Seguro que quieres terminar la sala?
fr: Voulez-vous vraiment terminer la salle ?
ru: Вы уверены, что хотите завершить комнату?

# roomHasOtherUsersDisconnect
source: There are
de: Es gibt
es: Hay
fr: Il y a
ru: В комнате есть

# users
source: other users in the room who will be disconnected.
de: andere Benutzer im Raum, die getrennt werden.
es: otros usuarios en la sala que serán desconectados.
fr: autres utilisateurs dans la salle qui seront déconnectés.
ru: других пользователей, которые будут отключены.

source: Cannot open link
de: Link kann nicht geöffnet werden
es: No se puede abrir el enlace
fr: Impossible d'ouvrir le lien
ru: Невозможно открыть ссылку

# openLinkFailed
source: Failed to open link
de: Öffnen des Links fehlgeschlagen
es: Error al abrir el enlace
fr: Échec d'ouverture du lien
ru: Не удалось открыть ссылку

# currentLatestVersion
source: You are using the latest version
de: Sie verwenden die neueste Version
es: Estás usando la versión más reciente
fr: Vous utilisez la dernière version
ru: Вы используете последнюю версию

# appDescription
source: Syncro is a cross-platform video sync playback app that supports multi-user online synchronized video watching. No matter how far apart you and your friends are, you can enjoy synchronized viewing experience together.
de: Syncro ist eine plattformübergreifende Video-Sync-Playback-App, die multiuser-Online-synchronisierte Video-Wiedergabe unterstützt. Egal wie weit Sie und Ihre Freunde voneinander entfernt sind, können Sie gemeinsam eine synchronisierte Wiedergabeerfahrung genießen.
es: Syncro es una aplicación de reproducción de vídeo sincronizada multiplataforma que admite la visualización de vídeo sincronizada en línea para múltiples usuarios. No importa cuán lejos estés de tus amigos, puedes disfrutar juntos de una experiencia de visualización sincronizada.
fr: Syncro est une application de lecture vidéo synchronisée multiplateforme qui prend en charge la visionnage vidéo synchronisé en ligne pour plusieurs utilisateurs. Peu importe à quelle distance vous et vos amis êtes, vous pouvez profiter ensemble d'une expérience de visionnage synchronisée.
ru: Syncro — это кроссплатформенное приложение для синхронизированного воспроизведения видео, поддерживающее многопользовательское онлайн-синхронизированное просмотр видео. Независимо от того, насколько далеко вы от друзей, вы можете вместе наслаждаться синхронизированным просмотром.

# checkUpdate
source: Check for Updates
de: Auf Updates prüfen
es: Comprobar actualizaciones
fr: Vérifier les mises à jour
ru: Проверить обновления

# checkForNewVersion
source: Check if there is a new version
de: Prüfen, ob eine neue Version verfügbar ist
es: Comprobar si hay una nueva versión
fr: Vérifier s'il y a une nouvelle version
ru: Проверить, есть ли новая версия

source: GitHub Open Source URL
es: URL de GitHub del código abierto
fr: URL GitHub du code source
ru: GitHub URL исходного кода

source: Open Source License Statement
de: Open-Source-Lizenz-Erklärung
es: Declaración de licencia de código abierto
fr: Déclaration de licence open source
ru: Описание лицензии открытого кода

source: View used open source libraries
de: Verwendete Open-Source-Bibliotheken anzeigen
es: Ver bibliotecas de código abierto utilizadas
fr: Voir les bibliothèques open source utilisées
ru: Просмотреть используемые библиотеки открытого кода

source: Player not initialized
de: Player nicht initialisiert
es: Reproductor no inicializado
fr: Lecteur non initialisé
ru: Плеер не инициализирован

source: No available audio tracks
de: Keine verfügbaren Audiospuren
es: No hay pistas de audio disponibles
fr: Aucune piste audio disponible
ru: Нет доступных аудиодорожек

source: Audio Track
de: Audiospur
es: Pista de audio
fr: Piste audio
ru: Аудиодорожка

source: Embedded Subtitles
de: Integrierte Untertitel
es: Subtítulos incrustados
fr: Sous-titres intégrés
ru: Встроенные субтитры

source: Restore Subtitle
de: Untertitel wiederherstellen
es: Restaurar subtítulos
fr: Restaurer les sous-titres
ru: Восстановить субтитры

source: Disable Subtitle
de: Untertitel deaktivieren
es: Desactivar subtítulos
fr: Désactiver les sous-titres
ru: Отключить субтитры

source: No embedded subtitles
de: Keine integrierten Untertitel
es: No hay subtítulos incrustados
fr: Aucun sous-titre intégré
ru: Нет встроенных субтитров

# externalSubtitlesHostOnly
source: External Subtitle (Host Only)
de: Externer Untertitel (nur Host)
es: Subtítulo externo (solo anfitrión)
fr: Sous-titre externe (hôte uniquement)
ru: Внешние субтитры (только для хоста)

source: Load External Subtitle
de: Externen Untertitel laden
es: Cargar subtítulo externo
fr: Charger un sous-titre externe
ru: Загрузить внешние субтитры

source: External subtitle synced to all members
de: Externer Untertitel auf alle Mitglieder synchronisiert
es: Subtítulo externo sincronizado a todos los miembros
fr: Sous-titre externe synchronisé sur tous les membres
ru: Внешние субтитры синхронизированы со всеми участниками

source: Subtitle
de: Untertitel
es: Subtítulo
fr: Sous-titre
ru: Субтитры

source: Font Size
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de police
ru: Размер шрифта

source: Show Background
de: Hintergrund anzeigen
es: Mostrar fondo
fr: Afficher l'arrière-plan
ru: Показать фон

source: Opacity
de: Deckkraft
es: Opacidad
fr: Opacité
ru: Прозрачность

source: Restore Default
de: Standard zurücksetzen
es: Restaurar valores por defecto
fr: Réinitialiser
ru: Восстановить по умолчанию

source: Font Color
de: Schriftfarbe
es: Color de fuente
fr: Couleur de police
ru: Цвет шрифта

source: Preview Effect
de: Vorschau-Effekt
es: Efecto de vista previa
fr: Effet d'aperçu
ru: Эффект предварительного просмотра

source: Subtitle Preview Effect
de: Untertitel-Vorschau-Effekt
es: Efecto de vista previa de subtítulos
fr: Effet d'aperçu des sous-titres
ru: Эффект предварительного просмотра субтитров

source: Video List
de: Videoliste
es: Lista de vídeos
fr: Liste de vidéos
ru: Список видео

source: Loaded
de: Geladen
es: Cargado
fr: Chargé
ru: Загружено

source: All room members will automatically load this subtitle
de: Alle Raummitglieder laden diesen Untertitel automatisch
es: Todos los miembros de la sala cargarán automáticamente este subtítulo
fr: Tous les membres de la salle chargeront automatiquement ce sous-titre
ru: Все участники комнаты автоматически загрузят эти субтитры

source: Can select .srt or .ass subtitle files
de: Sie können .srt- oder .ass-Untertiteldateien auswählen
es: Puedes seleccionar archivos de subtítulos .srt o .ass
fr: Vous pouvez sélectionner des fichiers .srt ou .ass
ru: Вы можете выбрать файлы субтитров .srt или .ass

# hostHasNotLoadedExternalSubtitles
source: Host has not loaded external subtitle
de: Host hat keinen externen Untertitel geladen
es: El anfitrión no ha cargado subtítulos externos
fr: L'hôte n'a pas chargé de sous-titre externe
ru: Хост не загрузил внешние субтитры

source: Clear Subtitle
de: Untertitel löschen
es: Limpiar subtítulos
fr: Effacer les sous-titres
ru: Очистить субтитры

source: Add Subtitle
de: Untertitel hinzufügen
es: Añadir subtítulo
fr: Ajouter un sous-titre
ru: Добавить субтитры

source: Clear Playlist
de: Wiedergabeliste leeren
es: Limpiar lista de reproducción
fr: Vider la liste de lecture
ru: Очистить список воспроизведения

# confirmClearAllVideos
source: Are you sure you want to clear all videos? This cannot be undone.
de: Möchten Sie wirklich alle Videos löschen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Seguro que quieres limpiar todos los vídeos? Esta acción no se puede deshacer.
fr: Voulez-vous vraiment vider toutes les vidéos ? Cette action est irréversible.
ru: Вы уверены, что хотите очистить все видео? Это действие нельзя отменить.

source: Clear
de: Löschen
es: Limpiar
fr: Effacer
ru: Очистить

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
ru: Добавить

source: Clear List
de: Liste leeren
es: Limpiar lista
fr: Vider la liste
ru: Очистить список

source: Playlist
de: Wiedergabeliste
es: Lista de reproducción
fr: Liste de lecture
ru: Список воспроизведения

source: Add Video
de: Video hinzufügen
es: Añadir vídeo
fr: Ajouter une vidéo
ru: Добавить видео

source: External Subtitles
de: Externe Untertitel
es: Subtítulos externos
fr: Sous-titres externes
ru: Внешние субтитры

source: Style
de: Stil
es: Estilo
ru: Стиль
